Repository: equqe/conversion-bot
Catalog: locale/*/LC_MESSAGES/bbot.po
Languages: ru_ru

source: get info about bot
ru_ru: ïîñìîòðåòü èíôî î áîòå

source: to resize an image
ru_ru: ðåäàêòèðîâàòü ðàçìåð ôîòî

source: to remove image background
ru_ru: óäàëèòü ôîí ñ ôîòî

source: change locale
ru_ru: ïîìåíÿòü ÿçûê

source: cancel current step
ru_ru: îñòàíîâèòü âûïîëíåíèå òåêóùåé êîìàíäû

source: hi! this is a bot that can help you with editing a picture to telegram sticker format OR editing by picking a custom resolution. you can create your pack with official bot @Stickers.
ru_ru: ïðèâåò! ýòîò áîò ìîæåò êîíâåðòèðîâàòü ôîòî â íóæíûé ðàçìåð èëè ôîðìàò äëÿ ñîçäàíèÿ òåëåãðàì ñòèêåðîâ. ñîçäàòü ïàê ìîæíî ÷åðåç îôèöèàëüíîãî áîòà @Stickers.

source: <b>sticker format requirements from @Stickers:</b> <i>The image file should be in PNG or WEBP format, with a transparent background(optionally) and must fit into a 512x512 square (each side must be greater than or equal to 512px).</i> you can take a look at command list, get a project github link and view some additional info about project with /help command.
ru_ru: <b>íóæíûé ôîðìàò ôîòî äëÿ ñîçäàíèÿ ñòèêåðà â @Stickers:</b> <i>ôîòî äîëæíî áûòü â ôîðìàòå .PNG èëè .WEBP, ñ ïðîçðà÷íûì ôîíîì(îïöèîíàëüíî) è äîëæíî ïîìåùàòüñÿ â êâàäðàò 512õ512(êàæäàÿ èç ñòîðîí äîëæíà áûòü áîëüøå èëè ðàâíà 512px).</i> âû ìîæåòå ïîñìîòðåòü íà ñïèñîê äîñòóïíûõ êîìàíä, ïðîåêò íà ãèòõàáå è ïðî÷óþ äîïîëíèòåëüíóþ èíôîðìàöèþ ÷åðåç êîìàíäó /help.

source: <b>INFO</b> <b>available commands</b> /help — to get info about bot(commands, q&a, author) /resize — to resize an image. the command has few options: 512*512(sticker), 100*100(sticker pack cover) and custom(max 5000*5000). /rembg — to remove image background /lang — to change a locale(ru/eng) <b>sticker format requirements from @Stickers</b> The image file should be in PNG or WEBP format with a transparent background(optionally) and must fit into a 512x512 square (one of the sides must be 512px and the other 512px or less). <b>about code</b> you can take a look at bot's code on github: https://github.com/equqe/conversion-bot <b>about project & author</b> this is a open-source project. if you have any ideas, you can message me on tg(@html_F5F5F5) OR do a commit on github to make code work and look better if you want. if bot works INCORRECTLY, feel free to message me too.
ru_ru: <b>ÈÍÔÎ</b> <b>äîñòóïíûå êîìàíäû</b> /help — èíôîðìàöèÿ î áîòå(êîìàíäû, q&a, àâòîð) /resize — îòðåäàêòèðîâàòü ðàçìåð ôîòî. ó êîìàíäû åñòü íåñêîëüêî îïöèé: 512*512(ñòèêåð), 100*100(îáëîæêà ñòèêåðïàêà) è êàñòîì(ìàêñ 5000*5000, ìèí 1*1). /rembg — óäàëèòü ôîí ñ ôîòî /lang — ïîìåíÿòü ÿçûê(ru/eng) <b>íóæíûé ôîðìàò ôîòî äëÿ ñîçäàíèÿ ñòèêåðà â @Stickers:</b> ôîòî äîëæíî áûòü â ôîðìàòå .PNG èëè .WEBP ñ ïðîçðà÷íûì ôîíîì(îïöèîíàëüíî) è äîëæíî ïîìåùàòüñÿ â êâàäðàò 512õ512(êàæäàÿ èç ñòîðîí äîëæíà áûòü áîëüøå èëè ðàâíà 512px). <b>î êîäå</b> âû ìîæåòå ïîñìîòðåòü íà êîä ïðîåêòà íà ãèòõàáå: https://github.com/equqe/conversion-bot <b>î ïðîåêòå è î àâòîðå</b> ýòî îïåíñîðñ ïðîåêò. åñëè ó âàñ åñòü êàêèå-òî èäåè, ïèøèòå ìíå â òã(@html_F5F5F5) èëè ñäåëàéòå êîììèò, åñëè õîòèòå ñäåëàòü êîä ëó÷øå. åñëè áîò ðàáîòàåò íåïðàâèëüíî, íàïèøèòå ìíå!

source: send the photo to remove its background!
ru_ru: îòïðàâüòå ôîòî, ÷òîáû óäàëèòü ñ íåãî ôîí!

source: select one resolution below:
ru_ru: âûáåðèòå îäíî èç ðàçðåøåíèé ñíèçó:

source: okay! you chose 512*512. now send me a picture
ru_ru: îòëè÷íî, âû âûáðàëè 512*512. òåïåðü îòïðàâüòå ìíå ôîòî

source: okay! you chose 100*100. now send me a picture <i>remark: results might look kinda cursed, so i recommend to crop an image to square-like form, because 100*100 is a square. otherwise your image will be shrank</i>
ru_ru: îòëè÷íî, âû âûáðàëè 100*100. òåïåðü îòïðàâüòå ìíå ôîòî <i>âàæíàÿ ðåìàðêà: ðåçóëüòàò ìîæåò âûãëÿäåòü íåëåïî, ïîýòîìó ÿ ðåêîìåíäóþ îòïðàâëÿòü ôîòî ñ îêîëîêâàäðàòíûì ðàçðåøåíèåì, âåäü 100*100 - êâàäðàò. èëè æå ôîòî áóäåò ñæàòî ïî îäíîé èç ñòîðîí</i>

source: okay! you chose custom size. now send me size in pixels. you send it in 'width height' format(e.g. 1920 1080. limits: MIN 1 1. MAX 5000 5000)
ru_ru: îòëè÷íî! âû âûáðàëè êàñòîì. òåïåðü îòïðàâüòå ìíå ðàçðåøåíèå â ïèêñåëÿõ. îòïðàâëÿéòå åãî â ôîðìàòå 'øèðèíà, âûñîòà'(íàïðèìåð 1920 1080. ëèìèòû: ìèí 1 1. ìàêñ 5000 5000)

source: you did something wrong..
ru_ru: âû ÷òî-òî ñäåëàëè íå òàê.

source: out of range!
ru_ru: ÷èñëà âûõîäÿò çà ëèìèò!

source: send the photo you want to resize
ru_ru: îòïðàâüòå ôîòî, ðàçðåøåíèå êîòîðîãî âû õîòèòå îòðåäàêòèðîâàòü

source: the custom size is
ru_ru: êàñòîìíîå ðàçðåøåíèå:

source: select the language:
ru_ru: âûáåðèòå ÿçûê:

source: command canceled. you can use /help to take a look at command list
ru_ru: âûïîëíåíèå êîìàíäû ïðåðâàíî. âû ìîæåòå èñïîëüçîâàòü /help, ÷òîáû ïîñìîòðåòü ñïèñîê äîñòóïíûõ êîìàíä

source: no commands to cancel!
ru_ru: íèêàêèå êîìàíäû íå âûïîëíÿþòñÿ!
